noble1911/claude-esp/firmware/sdkconfig.defaults
# ESP-IDF defaults for the Waveshare ESP32-S3-Touch-AMOLED-1.8 voice device.
# Mirrors pet-esp's known-good board config; per-build sdkconfig is generated.

CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Custom partition table (partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: 8 MB octal — LVGL draw buffers + audio buffers live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 kHz tick for smooth UI timing
CONFIG_FREERTOS_HZ=1000

# Main task stack — LVGL widget setup + init chain
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LVGL (v9): RGB565 to match the SH8601 panel format used by the BSP
CONFIG_LV_COLOR_DEPTH_16=y

# Route LVGL allocations through the C library (heap_caps) so large image-decode
# buffers land in PSRAM instead of the small builtin 64 KB pool.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
# PNG decoder for server-rendered screen images (display_image / SVG → PNG).
CONFIG_LV_USE_LODEPNG=y
# Image cache (PSRAM via CLIB malloc): decode each PNG once instead of re-decoding
# per render strip — otherwise large images only partially draw.
CONFIG_LV_CACHE_DEF_SIZE=1048576
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=4
# Cache-line (64 B) START alignment for LVGL draw buffers — the S3's octal PSRAM
# rejects DMA from sub-cache-line-aligned buffers, which broke the direct blit of
# decoded images. STRIDE_ALIGN must stay 1 (tight rows) or the framebuffer shears.
CONFIG_LV_DRAW_BUF_ALIGN=64

# Small LVGL flush buffer: PSRAM-sourced SPI DMA on this panel rejects single
# transfers above ~50 KB (observed). Height 40 caps each flush at ~29 KB so
# full-width image strips transfer successfully (cards never hit it; images did).
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=40

# TLS: bundled root CA store so wss:// to the Cloudflare-tunnelled gateway
# validates without shipping a per-host cert.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# WebSocket client: allow larger TX so a full mic/text frame fits.
CONFIG_WS_TRANSPORT=y
